// header 만들때 메뉴 + 카테고리 이런식으로 따로 만들어야함
// 절대 메뉴 카테고리 이렇게 한개의 컴포넌트로 만들면 안됨
// 그리고 모두 호버가 들어감

export function Header() {
  return (
    /* header 전체 */
    <header className="w-full h-[130px] bg-bg px-[100px] pt-[30px] pb-[14px]">
      <HeaderMenu />
    </header>
  );
}

/* 헤더 메뉴 로그인 x */
function HeaderMenu() {
  const menu = ['인기', '신규', '오픈예정', '마감임박', '환불정책'];
  const menuEl = menu.map(txt => (
    <li key={txt} className="h-[36px] flex justify-center items-center">
      {txt}
    </li>
  ));

  /* 메뉴 Gap 크기 */
  const menuGap = 25;

  return (
    <nav className="flex justify-between min-w-[480px] border-[1px] border-bg">
      {/* 타이틀, 메뉴 */}
      <div className="flex flex-col gap-y-[14px] semibold-14">
        {/* 타이틀 */}
        <svg width="100" height="36" viewBox="0 0 249 78" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M59.24 51.792V27.216H46.568V15.696H59.24V0.239994H73.64V51.792H59.24ZM0.2 47.472V35.952H12.68C11.24 28.848 6.536 24.336 0.2 24.336C6.92 24.336 11.72 19.344 12.872 11.568H0.2V1.008H47.336V11.568H42.344V35.952H47.336V47.472H0.2ZM13.64 35.952H27.944V11.568H13.448C14.6 19.344 19.496 24.336 26.216 24.336C19.784 24.336 15.08 28.848 13.64 35.952ZM14.984 51.888V65.808H77.576V77.328H0.584V51.888H14.984ZM157.294 39.504V51.024H87.8855V1.68H155.374V13.2H102.286V39.504H157.294ZM82.8935 76.368V64.848H162.286V76.368H82.8935ZM232.115 46.128V0.239994H246.515V46.128H232.115ZM173.075 12.528V1.008H220.211V28.944H187.475V34.032H222.899V45.552H173.075V17.424H205.811V12.528H173.075ZM173.459 77.424V48.336H246.707V65.904H248.819V77.424H173.459ZM187.763 65.904H232.403V58.896H187.763V65.904Z"
            fill="url(#paint0_linear_30_71)"
          />
          <defs>
            <linearGradient
              id="paint0_linear_30_71"
              x1="-7"
              y1="38.6174"
              x2="246.888"
              y2="33.3645"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#2D99F8" />
              <stop offset="1" stopColor="#091FB0" />
            </linearGradient>
          </defs>
        </svg>

        {/* 메뉴 */}
        <ul className={`flex gap-x-[${menuGap}px]`}>
          {/* 카테고리 */}
          <li key={'카테고리'} className="flex gap-2.5 h-[36px] justify-center items-center">
            {/* 카테고리 3선 이미지 */}
            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M2.5 10H17.5M2.5 15H17.5M2.5 5H17.5"
                stroke="currentColor"
                strokeWidth="1.66667"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
            <span>카테고리</span>
          </li>

          {/* 나머지 메뉴 */}
          {menuEl}
        </ul>
      </div>

      <div>
        <div className="flex gap-[25px] items-center">
          <span className="semibold-14">프로젝트 만들기</span>
          <button className="flex gap-[8.75px] border-[1px] rounded-[10px] border-secondary-200 px-[12.6px] py-[5px]">
            {/* 프로필 이미지 */}
            <svg width="20" height="20" viewBox="0 0 21 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M4.07328 16.4368C5.05029 15.7471 6.0704 15.2011 7.13362 14.7989C8.19684 14.3966 9.36063 14.1954 10.625 14.1954C11.8894 14.1954 13.0532 14.3966 14.1164 14.7989C15.1796 15.2011 16.1997 15.7471 17.1767 16.4368C17.9622 15.6513 18.5991 14.7126 19.0876 13.6207C19.5761 12.5287 19.8204 11.3218 19.8204 10C19.8204 7.45211 18.9248 5.28257 17.1336 3.49138C15.3424 1.70019 13.1729 0.804598 10.625 0.804598C8.07711 0.804598 5.90757 1.70019 4.11638 3.49138C2.32519 5.28257 1.4296 7.45211 1.4296 10C1.4296 11.3218 1.67385 12.5287 2.16236 13.6207C2.65086 14.7126 3.28784 15.6513 4.07328 16.4368ZM10.625 10.4023C9.70546 10.4023 8.9296 10.0862 8.29741 9.45402C7.66523 8.82184 7.34914 8.04598 7.34914 7.12644C7.34914 6.2069 7.66523 5.43103 8.29741 4.79885C8.9296 4.16667 9.70546 3.85057 10.625 3.85057C11.5445 3.85057 12.3204 4.16667 12.9526 4.79885C13.5848 5.43103 13.9009 6.2069 13.9009 7.12644C13.9009 8.04598 13.5848 8.82184 12.9526 9.45402C12.3204 10.0862 11.5445 10.4023 10.625 10.4023ZM10.625 20C9.22653 20 7.91906 19.7414 6.70259 19.2241C5.48611 18.7069 4.42768 17.9981 3.5273 17.0977C2.62692 16.1973 1.9181 15.1389 1.40086 13.9224C0.883621 12.7059 0.625 11.3985 0.625 10C0.625 8.60153 0.883621 7.29406 1.40086 6.07759C1.9181 4.86111 2.62692 3.80268 3.5273 2.9023C4.42768 2.00192 5.48611 1.2931 6.70259 0.775862C7.91906 0.258621 9.22653 0 10.625 0C12.0235 0 13.3309 0.258621 14.5474 0.775862C15.7639 1.2931 16.8223 2.00192 17.7227 2.9023C18.6231 3.80268 19.3319 4.86111 19.8491 6.07759C20.3664 7.29406 20.625 8.60153 20.625 10C20.625 11.3985 20.3664 12.7059 19.8491 13.9224C19.3319 15.1389 18.6231 16.1973 17.7227 17.0977C16.8223 17.9981 15.7639 18.7069 14.5474 19.2241C13.3309 19.7414 12.0235 20 10.625 20Z"
                fill="#B8B8BD"
              />
            </svg>

            <span className="semibold-14">로그인/회원가입</span>
          </button>
        </div>

        <div>
          <input type="text" placeholder="검색어를 입력해주세요." />
          <span>돋보기 이미지</span>
        </div>
      </div>
    </nav>
  );
}
